{
  "backend/main.mo": "Main canister actor implementing access control, user profiles, listening-time updates, and song/playlist data structures with storage mixins.",
  "feature_evidence.json": "Feature evidence describing long-press activation for Hidden Admin Mode including affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Collection of concise frontend file summaries detailing styles, components, hooks, and screen behaviors.",
  "frontend/index.css": "Base Tailwind setup defining OKLCH color variables for light/dark themes and applying global background/foreground styles.",
  "frontend/index.html": "HTML entry point loading the React app with manifest, icons, and root mount element.",
  "frontend/public/a2hs-beforeinstallprompt-snippet.html": "Standalone demo page showing PWA beforeinstallprompt handling with styled install banner.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, start URL, theme colors, icons, and categories.",
  "frontend/public/service-worker.js": "Service worker implementing caching for app shell and optional audio caching fallback logic.",
  "frontend/src/App.tsx": "Main app component managing navigation, deep links, authentication state, messaging drawer, and modals.",
  "frontend/src/components/account/ProfileCompletionModal.tsx": "Modal collecting required profile fields and submitting them after validation.",
  "frontend/src/components/admin/AboutArtistProfileEditor.tsx": "Admin editor for artist profile fields with validation, edit mode, and save handling.",
  "frontend/src/components/admin/AdminPasscodeModal.tsx": "Modal for entering or disabling admin passcode and toggling admin mode.",
  "frontend/src/components/auth/AdminOnly.tsx": "Conditional wrapper that restricts content to admin users with optional disabled or fallback display.",
  "frontend/src/components/branding/AppHeader.tsx": "App header displaying branding and a messages button with unread indicator for authenticated users.",
  "frontend/src/components/home/HomeChannelBanner.tsx": "Displays a customizable channel banner with admin-only controls for uploading, setting via URL, or clearing the image, plus a long‑press trigger for hidden admin mode.",
  "frontend/src/components/layout/AppShell.tsx": "Defines the main app layout including header, sidebar, background, PWA banner, and optional bottom tab bar.",
  "frontend/src/components/library/DeletePlaylistConfirmDialog.tsx": "Shows a confirmation dialog for deleting user or official playlists with pending-state feedback.",
  "frontend/src/components/library/LibraryPlaylistsPanel.tsx": "Manages viewing, creating, and deleting user and official playlists with dialogs and authentication handling.",
  "frontend/src/components/library/LibraryTopTabs.tsx": "Provides tabs for switching between songs and playlists in the library.",
  "frontend/src/components/library/PlaylistDetailView.tsx": "Displays playlist details with play, shuffle, repeat controls and loads songs based on playlist type.",
  "frontend/src/components/messaging/AdminConversationList.tsx": "Lists all user conversations for admins with loading, error states, and delete‑conversation options.",
  "frontend/src/components/messaging/AdminInboxDrawer.tsx": "Empty placeholder component file for the admin inbox drawer.",
  "frontend/src/components/messaging/AttachmentPicker.tsx": "Allows selecting, validating, and removing image, audio, or PDF attachments for messages.",
  "frontend/src/components/messaging/DeleteConversationConfirmDialog.tsx": "Dialog that confirms and executes deletion of a conversation using a mutation hook.",
  "frontend/src/components/messaging/MarioAvatar.tsx": "Avatar component that displays the MARIO image or a fallback icon with size options.",
  "frontend/src/components/messaging/MarioStatusPill.tsx": "Status indicator showing whether hidden admin mode is enabled as online or offline.",
  "frontend/src/components/messaging/MessageComposerForm.tsx": "Form for composing messages or song requests with attachments, supporting admin and user modes.",
  "frontend/src/components/messaging/MessageThread.tsx": "Displays a scrollable list of messages with attachments, avatars, and optional delete controls.",
  "frontend/src/components/messaging/UnifiedMessagesDrawer.tsx": "Sliding drawer managing user and admin message threads, message sending, deletion, and seen-state updates.",
  "frontend/src/components/messaging/UserMessagesDrawer.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/components/navigation/BottomTabBar.tsx": "Bottom navigation bar rendering tab buttons for main screens with active styling.",
  "frontend/src/components/navigation/Sidebar.tsx": "Sidebar navigation menu with user account info, install prompt, and authentication controls.",
  "frontend/src/components/onboarding/FirstLaunchWelcomePopup.tsx": "Welcome dialog prompting first‑time users to sign in with Internet Identity.",
  "frontend/src/components/player/MusicPlayer.tsx": "Audio player component handling play state, progress, volume, and authenticated listening-time tracking with backend mutations.",
  "frontend/src/components/pwa/A2HSBanner.behavior.md": "Documentation describing visibility, session hiding, and install‑interaction rules for the A2HS banner.",
  "frontend/src/components/pwa/A2HSBanner.tsx": "UI banner that appears when install is available and hides based on sessionStorage or install interactions.",
  "frontend/src/components/SignInModal.tsx": "Sign‑in modal or drawer that triggers Internet Identity login and handles cancel behavior.",
  "frontend/src/components/songs/CreatePlaylistDialog.tsx": "Dialog allowing users to create a playlist and add a song, with auth enforcement and mobile/desktop variants.",
  "frontend/src/components/songs/DownloadChooserDialog.tsx": "Dialog offering two download options—offline app caching or device download—adapted for mobile or desktop.",
  "frontend/src/components/songs/HorizontalSongCard.tsx": "Compact horizontal song card with artwork, play button, and overflow menu, supporting active‑song styling.",
  "frontend/src/components/songs/HorizontalSongRow.tsx": "Horizontal scrollable row wrapper displaying a section title and song cards.",
  "frontend/src/components/songs/PlaylistChooserDialog.tsx": "Dialog listing user playlists and allowing toggling a song's membership with auth handling and loading states.",
  "frontend/src/components/songs/SongCard.tsx": "Song card with artwork, play/delete actions, engagement bar, and overflow menu; supports active playback styling.",
  "frontend/src/components/songs/SongEditor.tsx": "Admin-only dialog for adding songs with form fields, file/URL uploads, validation, and mutation submission.",
  "frontend/src/components/songs/SongEngagementBar.tsx": "Displays like/play counts with an interactive like button using engagement hooks.",
  "frontend/src/components/songs/SongListRow.tsx": "Song list item showing artwork, metadata, play controls, engagement bar, and overflow actions.",
  "frontend/src/components/songs/SongOverflowMenu.tsx": "Song actions menu supporting favorites, playlists, sharing, downloading, and auth-gated flows.",
  "frontend/src/components/songs/SongsSortBar.tsx": "Dropdown bar for selecting sort order such as latest, most liked, or most heard.",
  "frontend/src/components/visual/StarfieldBackground.tsx": "Renders animated starfield background in dark mode with reduced‑animation support.",
  "frontend/src/config/featureFlags.ts": "Defines feature flags, currently enabling desktop bottom tab bar.",
  "frontend/src/context/AdminContext.tsx": "Provides admin-state context based on hidden admin mode without async loading.",
  "frontend/src/context/AuthContext.tsx": "Auth context handling pending actions, sign-in modal state, and navigation return paths.",
  "frontend/src/context/HiddenAdminModeContext.tsx": "Manages hidden admin mode via passcode, modal, keyboard shortcut, and session storage.",
  "frontend/src/hooks/useA2HS.ts": "Manages add-to-home-screen prompt state, installation detection, and triggering the install UI.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useFirstLaunchWelcome.ts": "Tracks whether the first‑launch welcome UI has been shown using localStorage.",
  "frontend/src/hooks/useHomeBanner.ts": "Manages a persisted home banner image, supporting URLs, file uploads, validation, and defaults.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, login/clear actions, and persistent identity handling via context.",
  "frontend/src/hooks/useIsAdmin.ts": "Deprecated hook that always reports non‑admin state for compatibility.",
  "frontend/src/hooks/useLikedSongs.ts": "Returns liked song IDs and an isLiked check based on authenticated user favorites.",
  "frontend/src/hooks/useListeningTime.ts": "Mutation hook that sends listening time updates to the backend and refreshes user profile data.",
  "frontend/src/hooks/useLongPress.ts": "Implements configurable long‑press detection with movement threshold and pointer event handlers.",
  "frontend/src/hooks/useMediaQuery.ts": "Provides a media query match boolean and a helper for mobile detection.",
  "frontend/src/hooks/useMessaging.ts": "Messaging hooks for fetching messages, sending with attachments, deleting, marking seen, and unread detection.",
  "frontend/src/hooks/usePendingAction.ts": "Executes deferred user actions after authentication, handling playlist, like, offline, download, and messaging tasks.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating songs and artist data, including admin‑protected song creation with file handling.",
  "frontend/src/hooks/useSettings.ts": "Provides a settings context with persistence to localStorage and utilities for updating UI-related preferences.",
  "frontend/src/hooks/useSongEngagement.ts": "Handles liking and playing songs with auth-aware flows using underlying mutation hooks.",
  "frontend/src/hooks/useTheme.ts": "Implements a theme context supporting light/dark mode with localStorage persistence.",
  "frontend/src/hooks/useUserProfile.ts": "React Query hooks for fetching and saving the caller’s user profile plus helpers for completeness and listening-time formatting.",
  "frontend/src/index.css": "Tailwind base styles plus custom CSS variables and theming for light/dark modes, animations, and form element fixes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers and loads global styles.",
  "frontend/src/pages/AboutArtistScreen.tsx": "Shows the artist’s bio and social links with optional admin editing and loading states.",
  "frontend/src/pages/ContactScreen.tsx": "Displays messaging entry points, explaining normal messages and custom song requests with a button to open the interface.",
  "frontend/src/pages/CustomSongRequestsScreen.tsx": "Empty placeholder file for the custom song requests screen.",
  "frontend/src/pages/HomeScreen.tsx": "Displays home view with song lists, music player, and admin delete handling; fetches songs, sorts them, and manages current playback state.",
  "frontend/src/pages/LibraryScreen.tsx": "Provides library tabs for songs, playlists, and favorites with playlist playback logic, queue management, and music player controls.",
  "frontend/src/pages/SearchScreen.tsx": "Searches songs by keyword, shows results grid, and includes a music player with next/previous navigation.",
  "frontend/src/pages/SettingsScreen.tsx": "Renders user settings for audio quality, visual effects, and notifications with update handlers.",
  "frontend/src/pages/SongsScreen.tsx": "Lists all songs with sorting, playback, and admin delete support, including deep link handling for initial song selection.",
  "frontend/src/pages/SupportScreen.tsx": "Shows support information with a link to donate and descriptive UI elements.",
  "frontend/src/pages/ThemesScreen.tsx": "Allows switching between light and dark themes with styled selection cards.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the app’s service worker on window load and logs success or errors.",
  "frontend/src/utils/artistProfileValidation.ts": "Validates required artist profile URLs and returns field-level errors with a helper to check if any exist.",
  "frontend/src/utils/authorizationErrors.ts": "Parses backend errors to detect auth, admin, or sign‑in requirements and maps them to user-facing messages.",
  "frontend/src/utils/dataUrl.ts": "Detects data URLs and converts them into byte arrays for storage.",
  "frontend/src/utils/deepLinks.ts": "Builds and parses song deep links via URL params and supports clearing them without reloads.",
  "frontend/src/utils/download.ts": "Checks audio URLs, generates safe filenames, and triggers browser downloads for song audio.",
  "frontend/src/utils/messagingAttachments.ts": "Validates file attachments by type and size and converts files to byte arrays.",
  "frontend/src/utils/offlineAudioCache.ts": "Caches, checks, removes, and clears audio files using the browser Cache API for offline playback.",
  "frontend/src/utils/playlistPlayback.ts": "Handles shuffling and navigation of playlist song indices and lookup by ID.",
  "frontend/src/utils/share.ts": "Provides Web Share API support and clipboard fallback for sharing song links or text.",
  "frontend/src/utils/songSort.ts": "Sorts songs by newest, top liked, or most played with deterministic tie‑breakers.",
  "frontend/src/utils/structuredMessageFormat.ts": "Formats normal messages and custom song requests into consistent multi-line text blocks.",
  "frontend/src/utils/urlParams.ts": "Reads, persists, and clears URL parameters using query strings, hashes, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH-based color system, container settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines current project state, major feature requirements for messaging, admin mode, UI rules, and includes architectural notes and known issues."
}