{
  "backend/main.mo": "Actor implements user profiles, song management with storage blobs, playlists, favorites, and access control using authorization mixins.",
  "feature_evidence.json": "Feature evidence report listing two UI banner-related features tied to HomeChannelBanner.tsx with metadata and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing key frontend files, their responsibilities, and recent behavioral or styling changes.",
  "frontend/index.css": "Tailwind base layer defining OKLCH design tokens for light/dark themes and applying global background, text, and border styles.",
  "frontend/index.html": "Base HTML document setting metadata, manifest, icons, root mount point, and loading the main TypeScript entry.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining metadata, theme colors, icons, categories, and launch behavior for the app.",
  "frontend/public/service-worker.js": "Service worker handling app shell caching, specialized audio fetch behavior, and cache cleanup during activate.",
  "frontend/src/App.tsx": "Main application component handling screen navigation, deep links, global providers, onboarding popup, and sign‑in modal.",
  "frontend/src/components/branding/AppHeader.tsx": "Header displaying the app logo, title, and subtitle with basic layout and styling.",
  "frontend/src/components/home/HomeChannelBanner.tsx": "Displays and manages a channel banner with image upload, URL input, and clearing options.",
  "frontend/src/components/layout/AppShell.tsx": "Wraps the app layout with header, sidebar, optional starfield, footer, and bottom navigation.",
  "frontend/src/components/library/LibraryPlaylistsPanel.tsx": "Shows user playlists, handles playlist creation, and manages auth flow for creating playlists.",
  "frontend/src/components/library/LibraryTopTabs.tsx": "Renders top tabs for switching between songs and playlists in the library.",
  "frontend/src/components/navigation/BottomTabBar.tsx": "Provides a bottom navigation bar with tabs for major screens, adapting to desktop mode optionally.",
  "frontend/src/components/navigation/Sidebar.tsx": "Implements mobile and desktop side navigation with menu items and an option to trigger PWA install.",
  "frontend/src/components/onboarding/FirstLaunchWelcomePopup.tsx": "Displays a first‑launch welcome popup with guest and sign‑in options.",
  "frontend/src/components/player/MusicPlayer.tsx": "Full music player component handling playback, seeking, volume, and play count updates.",
  "frontend/src/components/pwa/A2HSBanner.tsx": "Displays a dismissible add-to-home-screen banner using sessionStorage and a custom A2HS hook.",
  "frontend/src/components/SignInModal.tsx": "Component rendering a modal or drawer for Internet Identity sign‑in with loading states and cancellation logic.",
  "frontend/src/components/songs/CreatePlaylistDialog.tsx": "Dialog/drawer for creating a playlist and adding a song, with auth handling and mutation calls.",
  "frontend/src/components/songs/DownloadChooserDialog.tsx": "Dialog/drawer that lets users choose between offline caching or downloading a song to their device.",
  "frontend/src/components/songs/HorizontalSongCard.tsx": "Compact horizontal song card showing artwork, metadata, engagement bar, and a play button.",
  "frontend/src/components/songs/HorizontalSongRow.tsx": "Scrollable horizontal row component for grouping song cards under a section title.",
  "frontend/src/components/songs/PlaylistChooserDialog.tsx": "Dialog/drawer for toggling a song’s inclusion in user playlists with auth and loading states.",
  "frontend/src/components/songs/SongCard.tsx": "Full song card with artwork, play/delete controls, engagement bar, and overflow menu.",
  "frontend/src/components/songs/SongEditor.tsx": "Editor dialog for adding songs with form fields, file uploads, and mutation submission.",
  "frontend/src/components/songs/SongEngagementBar.tsx": "Displays like and play counts with an optional like button that handles engagement logic.",
  "frontend/src/components/songs/SongListRow.tsx": "Renders a clickable song row with artwork, play button, delete option, and overflow menu.",
  "frontend/src/components/songs/SongOverflowMenu.tsx": "Provides song action menus for favorites, playlists, downloads, sharing, and offline caching with auth handling.",
  "frontend/src/components/songs/SongsSortBar.tsx": "Renders a dropdown to select song sorting mode such as latest or most liked.",
  "frontend/src/components/visual/StarfieldBackground.tsx": "Creates an animated starfield background in dark mode using dynamically generated div elements.",
  "frontend/src/config/featureFlags.ts": "Defines feature flags including enabling a desktop bottom tab bar.",
  "frontend/src/context/AuthContext.tsx": "Manages authentication state, pending actions, sign‑in modal behavior, and return‑path restoration.",
  "frontend/src/hooks/useA2HS.ts": "Detects installability and exposes a function to trigger the browser’s add‑to‑home‑screen prompt.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries on change.",
  "frontend/src/hooks/useFirstLaunchWelcome.ts": "Controls whether a first‑launch welcome UI should show based on localStorage state.",
  "frontend/src/hooks/useHomeBanner.ts": "Manages persistent customizable home banner image via URL or uploaded file.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, identity persistence, and login status via a React context.",
  "frontend/src/hooks/useMediaQuery.ts": "Provides hooks to evaluate CSS media queries and detect mobile viewport size.",
  "frontend/src/hooks/usePendingAction.ts": "Executes queued user actions after authentication and handles retries and error states.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for fetching, mutating, and updating song and playlist data via the backend actor.",
  "frontend/src/hooks/useSettings.ts": "Manages user settings with context, localStorage persistence, and UI side effects.",
  "frontend/src/hooks/useSongEngagement.ts": "Handles liking and playing songs, triggering auth when needed and delegating to mutations.",
  "frontend/src/hooks/useTheme.ts": "Provides theme context with light/dark mode persistence and DOM updates.",
  "frontend/src/index.css": "Defines Tailwind layers, color variables, themes, and global styling behaviors including reduced animations.",
  "frontend/src/main.tsx": "App entry point configuring React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/AboutArtistScreen.tsx": "Renders an about page with artist info and external links to social platforms.",
  "frontend/src/pages/ContactScreen.tsx": "Displays a contact page with message and email link for inquiries.",
  "frontend/src/pages/CustomSongRequestsScreen.tsx": "Page offering custom song request info with links for support and email contact.",
  "frontend/src/pages/HomeScreen.tsx": "Fetches songs, manages playback and deletion, and displays new, top, and all songs with a music player.",
  "frontend/src/pages/LibraryScreen.tsx": "Shows user's library with tabs for songs and playlists, plus a music player and basic navigation.",
  "frontend/src/pages/SearchScreen.tsx": "Provides live song search with a query field, displays results, and includes playback controls.",
  "frontend/src/pages/SettingsScreen.tsx": "Offers configurable audio, visual, and notification settings using UI controls.",
  "frontend/src/pages/SongsScreen.tsx": "Lists all songs with sorting, playback, deletion, and deep‑link support.",
  "frontend/src/pages/SupportScreen.tsx": "Displays support information and links for donating to the project.",
  "frontend/src/pages/ThemesScreen.tsx": "Allows switching between light and dark themes using themed selection cards.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker on page load for PWA support.",
  "frontend/src/utils/deepLinks.ts": "Provides helpers to build, parse, and clear song deep‑link parameters from query or hash routing.",
  "frontend/src/utils/download.ts": "Handles audio URL validation, filename generation, and triggering song downloads via a temporary anchor.",
  "frontend/src/utils/offlineAudioCache.ts": "Implements caching, checking, removing, and clearing audio files using the browser Cache API for offline playback.",
  "frontend/src/utils/share.ts": "Offers Web Share API support and clipboard fallback utilities for sharing song links or text.",
  "frontend/src/utils/urlParams.ts": "Manages URL and sessionStorage parameters, including retrieval, persistence, and cleanup of values in query or hash routing.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, animations, and plugins including typography, container queries, and animate.",
  "project_state.json": "Stores the project’s current build state, high‑level feature plan, architecture notes, and known issues."
}