{
  "backend/main.mo": "Main backend canister implementing access control, user profiles, song management, likes, plays, favorites, and playlist storage with admin‑artist permissions.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purposes of many frontend files including components, hooks, and utilities.",
  "frontend/index.css": "Tailwind base/theme variables defining light/dark modes and global styles using OKLCH color values.",
  "frontend/index.html": "Base HTML document loading main React bundle and PWA metadata.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, icons, theme colors, and launch behavior.",
  "frontend/public/service-worker.js": "Service worker handling caching for app shell and audio files with separate caches and offline behavior.",
  "frontend/src/App.tsx": "Root React app managing navigation, providers, deep links, welcome popup, sign‑in modal, and screen rendering.",
  "frontend/src/components/auth/AdminOnly.tsx": "Components that conditionally render or disable children based on admin status, with optional fallback or tooltip.",
  "frontend/src/components/branding/AppHeader.tsx": "Sticky header displaying the app logo and title with a simple visual layout.",
  "frontend/src/components/home/HomeChannelBanner.tsx": "Admin‑editable home banner allowing image upload, URL input, and clearing, with display of the channel image and title.",
  "frontend/src/components/layout/AppShell.tsx": "Main app layout including sidebar, header, content area, bottom tabs, and optional starfield background.",
  "frontend/src/components/library/LibraryPlaylistsPanel.tsx": "Playlist panel that loads user playlists, handles playlist creation, and prompts unauthenticated users to sign in.",
  "frontend/src/components/library/LibraryTopTabs.tsx": "Tabs for switching between the songs and playlists views in the library section.",
  "frontend/src/components/navigation/BottomTabBar.tsx": "Bottom navigation bar for switching screens with active tab highlighting and optional desktop display.",
  "frontend/src/components/navigation/Sidebar.tsx": "Sidebar with navigation links, mobile sheet mode, and an option to trigger PWA install.",
  "frontend/src/components/onboarding/FirstLaunchWelcomePopup.tsx": "Popup offering guest mode or Internet Identity sign‑in, with handlers for login and dismissal.",
  "frontend/src/components/player/MusicPlayer.tsx": "Audio player handling playback, seeking, volume, play count incrementing, and song navigation.",
  "frontend/src/components/pwa/A2HSBanner.tsx": "Banner prompting users to install the PWA, with session‑based hide logic.",
  "frontend/src/components/SignInModal.tsx": "Sign-in modal/drawer that triggers Internet Identity login and handles mobile vs desktop layouts.",
  "frontend/src/components/songs/CreatePlaylistDialog.tsx": "Dialog or drawer allowing authenticated users to create a playlist and add the current song.",
  "frontend/src/components/songs/DownloadChooserDialog.tsx": "Dialog offering offline caching or device download options for a song.",
  "frontend/src/components/songs/HorizontalSongCard.tsx": "Compact song card showing artwork, play button, metadata, and overflow actions.",
  "frontend/src/components/songs/HorizontalSongRow.tsx": "Horizontal scrollable row layout for grouping song cards with a section title.",
  "frontend/src/components/songs/PlaylistChooserDialog.tsx": "Dialog for adding or removing a song from user playlists with auth handling.",
  "frontend/src/components/songs/SongCard.tsx": "Displays a clickable song card with artwork, play/delete controls, engagement bar, and overflow menu.",
  "frontend/src/components/songs/SongEditor.tsx": "Admin-only dialog for adding songs, handling file uploads, field validation, and mutation submission.",
  "frontend/src/components/songs/SongEngagementBar.tsx": "Shows like and play counts with an optional like button that triggers engagement mutations.",
  "frontend/src/components/songs/SongListRow.tsx": "Renders a compact row-style song item with image, play button, engagement bar, and optional delete action.",
  "frontend/src/components/songs/SongOverflowMenu.tsx": "Provides a mobile/desktop overflow menu for actions like favoriting, playlist management, downloads, and sharing.",
  "frontend/src/components/songs/SongsSortBar.tsx": "Dropdown bar allowing users to sort songs by latest, most liked, or most heard.",
  "frontend/src/components/visual/StarfieldBackground.tsx": "Generates an animated starfield background in dark theme, respecting reduced animation settings.",
  "frontend/src/config/featureFlags.ts": "Defines feature flags, currently enabling desktop bottom tab bar.",
  "frontend/src/context/AdminContext.tsx": "Context provider exposing admin status and loading state using useIsAdmin.",
  "frontend/src/context/AuthContext.tsx": "Provides auth state, pending action handling, and soft sign‑in modal control including scroll/return path preservation.",
  "frontend/src/hooks/useA2HS.ts": "Handles PWA install prompts by capturing the beforeinstallprompt event and exposing an install trigger.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user's identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useFirstLaunchWelcome.ts": "Tracks and displays a first‑launch welcome screen using localStorage.",
  "frontend/src/hooks/useHomeBanner.ts": "Manages a customizable home banner image with localStorage persistence and file validation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Wraps Dfinity AuthClient to manage Internet Identity login, identity restoration, and related status flags.",
  "frontend/src/hooks/useIsAdmin.ts": "Queries backend to determine if the authenticated user is an admin/artist and caches the result.",
  "frontend/src/hooks/useLikedSongs.ts": "Provides quick lookup of liked songs using favorites data and the current user's authentication state.",
  "frontend/src/hooks/useMediaQuery.ts": "Exposes responsive media query matching and a helper for mobile detection.",
  "frontend/src/hooks/usePendingAction.ts": "Executes queued user actions after authentication, supporting likes, playlist edits, offline caching, and downloads.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching, adding, deleting, searching, and interacting with songs, including blob handling and error toasts.",
  "frontend/src/hooks/useSettings.ts": "Implements a settings context with persistence in localStorage and options for audio quality, animations, effects, and notifications.",
  "frontend/src/hooks/useSongEngagement.ts": "Wraps like and play interactions with auth checks, triggering authentication when required.",
  "frontend/src/hooks/useTheme.ts": "Provides a theme context with light/dark mode support stored in localStorage and applied to the document root.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive light/dark CSS variables, global styles, and reduced-animation rules.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutArtistScreen.tsx": "Renders an about page with artist info and external links to social platforms.",
  "frontend/src/pages/ContactScreen.tsx": "Displays a contact page with a description and email link for inquiries.",
  "frontend/src/pages/CustomSongRequestsScreen.tsx": "Shows a page explaining custom song requests with links for support and email contact.",
  "frontend/src/pages/HomeScreen.tsx": "Home page showing song lists, music player, song deletion, and sections for new and top songs.",
  "frontend/src/pages/LibraryScreen.tsx": "Displays the user's library with songs, favorites, playlists, and a music player, handling authentication and song navigation.",
  "frontend/src/pages/SearchScreen.tsx": "Provides keyword-based song search with results listing and an integrated music player.",
  "frontend/src/pages/SettingsScreen.tsx": "Renders user-configurable settings for audio quality, visual effects, and notifications.",
  "frontend/src/pages/SongsScreen.tsx": "Shows all songs with sorting, admin deletion, deep link handling, and a music player.",
  "frontend/src/pages/SupportScreen.tsx": "Displays donation information and a link to support the project.",
  "frontend/src/pages/ThemesScreen.tsx": "Allows selecting between light and dark themes with visual previews.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker on page load for PWA functionality.",
  "frontend/src/utils/authorizationErrors.ts": "Parses backend authorization errors and provides user-friendly error messages.",
  "frontend/src/utils/dataUrl.ts": "Provides helpers to detect data URLs and convert them to byte arrays.",
  "frontend/src/utils/deepLinks.ts": "Builds, parses, and clears song deep‑link URL parameters using query or hash routing.",
  "frontend/src/utils/download.ts": "Validates audio URLs, creates safe filenames, and triggers browser downloads for song audio.",
  "frontend/src/utils/offlineAudioCache.ts": "Manages caching, checking, removing, and clearing audio files for offline playback using the Cache API.",
  "frontend/src/utils/share.ts": "Provides Web Share API helpers and clipboard fallback utilities for sharing song links or text.",
  "frontend/src/utils/urlParams.ts": "Handles reading, persisting, and clearing URL parameters, including sessionStorage-backed retrieval.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, and plugins for the frontend.",
  "project_state.json": "Defines the project’s current state, requirements, UI rules, and architectural notes for MVRIO Night."
}