{
  "backend/main.mo": "Motoko canister handling user profiles, song management, likes, plays, and playlist storage with access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report mapping two features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing many frontend files' functionality across UI, hooks, and components.",
  "frontend/index.css": "Tailwind CSS root theme variables and dark mode definitions with base element styling.",
  "frontend/index.html": "Base HTML document loading the app root and main entry script with metadata and manifest link.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name, icons, theme colors, start URL, and categories.",
  "frontend/public/service-worker.js": "Service worker implementing caching for app shell and custom audio fetch handling with offline fallbacks.",
  "frontend/src/App.tsx": "Top-level React app managing screen navigation, deep links, and providers for theme and settings.",
  "frontend/src/components/branding/AppHeader.tsx": "Header displaying app branding with icon, title, and subtitle.",
  "frontend/src/components/home/HomeChannelBanner.tsx": "UI for displaying and managing a customizable home banner image via upload or URL.",
  "frontend/src/components/layout/AppShell.tsx": "Provides the main application layout with starfield background, header, sidebar, footer, and bottom tab bar, wrapping page content.",
  "frontend/src/components/library/LibraryPlaylistsPanel.tsx": "Displays user playlists with create-playlist functionality and authentication checks, including loading and empty states.",
  "frontend/src/components/library/LibraryTopTabs.tsx": "Renders top tabs for switching between Songs and Playlists in the library section.",
  "frontend/src/components/navigation/BottomTabBar.tsx": "Shows a mobile-friendly bottom navigation bar with icons, highlighting the active screen and handling navigation.",
  "frontend/src/components/navigation/Sidebar.tsx": "Implements mobile and desktop sidebars with navigation items and an Add to Home Screen action.",
  "frontend/src/components/player/MusicPlayer.tsx": "Audio player component handling playback, seeking, volume, metadata, and play-count incrementing for a selected song.",
  "frontend/src/components/pwa/A2HSBanner.tsx": "Displays a dismissible banner prompting users to install the app to their home screen via A2HS.",
  "frontend/src/components/songs/CreatePlaylistDialog.tsx": "Provides a dialog or drawer for creating a new playlist and adding a song to it, with validation and mutation handling.",
  "frontend/src/components/songs/DownloadChooserDialog.tsx": "Provides a dialog or drawer for choosing between offline caching or device download, with mobile-specific UI behavior.",
  "frontend/src/components/songs/HorizontalSongCard.tsx": "Renders a compact horizontal song card with artwork, play button, and engagement bar, supporting play state visuals.",
  "frontend/src/components/songs/HorizontalSongRow.tsx": "Displays a titled horizontal scrollable row for song cards using a ScrollArea with a horizontal scrollbar.",
  "frontend/src/components/songs/PlaylistChooserDialog.tsx": "Shows a dialog or drawer listing user playlists and allows toggling a song's inclusion with loading and mutation handling.",
  "frontend/src/components/songs/SongCard.tsx": "A stylized card showing song artwork, metadata, engagement bar, and controls for play, delete, and overflow actions.",
  "frontend/src/components/songs/SongEditor.tsx": "Implements a dialog-based form for adding new songs, supporting metadata entry and file uploads with validation.",
  "frontend/src/components/songs/SongEngagementBar.tsx": "Displays like and play counts with optional like button handling authentication and interaction events.",
  "frontend/src/components/songs/SongListRow.tsx": "Renders a list-style row for a song with artwork, metadata, engagement bar, and controls for play, delete, and overflow actions.",
  "frontend/src/components/songs/SongOverflowMenu.tsx": "Provides a mobile/desktop overflow menu for song actions like favorites, playlists, downloads, sharing, and offline caching with authentication checks.",
  "frontend/src/components/songs/SongsSortBar.tsx": "Renders a dropdown selector to sort songs by latest, most liked, or most heard.",
  "frontend/src/components/visual/StarfieldBackground.tsx": "Generates an animated starfield background in dark mode, respecting reduced animation settings.",
  "frontend/src/config/featureFlags.ts": "Defines feature flags, currently enabling a desktop bottom tab bar.",
  "frontend/src/hooks/useA2HS.ts": "Handles PWA add‑to‑home‑screen prompt availability and triggering.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on user identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useHomeBanner.ts": "Manages persistent home banner image state, supporting URLs, uploads, validation, and fallback images.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity with login, logout, stored identity loading, and status tracking.",
  "frontend/src/hooks/useMediaQuery.ts": "Exposes media query matching and a helper hook to detect mobile viewports.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend song and playlist queries and mutations using React Query, including search, likes, and CRUD operations.",
  "frontend/src/hooks/useSettings.ts": "Stores and persists user settings like audio quality and animation preferences, updating DOM classes when needed.",
  "frontend/src/hooks/useSongEngagement.ts": "Provides like and play handlers for songs with authentication checks and mutation wiring.",
  "frontend/src/hooks/useTheme.ts": "Provides a React context for light/dark theme with localStorage persistence and helper hooks.",
  "frontend/src/index.css": "Defines Tailwind base styles and extensive CSS variables for light and dark themes with form input adjustments.",
  "frontend/src/main.tsx": "Initializes the React app root, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutArtistScreen.tsx": "Displays an about page for the artist with descriptive text and links to social platforms.",
  "frontend/src/pages/ContactScreen.tsx": "Renders a contact page with email link and introductory message.",
  "frontend/src/pages/CustomSongRequestsScreen.tsx": "Shows a page for requesting custom songs with support and email links.",
  "frontend/src/pages/HomeScreen.tsx": "Main home view showing new, top, and all songs with player controls and song management actions.",
  "frontend/src/pages/LibraryScreen.tsx": "Displays the user's library with tabs for songs and playlists plus an integrated music player.",
  "frontend/src/pages/SearchScreen.tsx": "Provides song search with live results, a music player, and keyword-based filtering.",
  "frontend/src/pages/SettingsScreen.tsx": "Renders settings UI for audio quality, visual effects, and notifications using switches and selectors tied to useSettings.",
  "frontend/src/pages/SongsScreen.tsx": "Displays all songs with sorting, playback controls, deletion, and deep‑link handling.",
  "frontend/src/pages/SupportScreen.tsx": "Shows support info and a link to buy the creator a coffee.",
  "frontend/src/pages/ThemesScreen.tsx": "Provides UI to switch between light and dark themes using useTheme.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker on page load and logs success or failure.",
  "frontend/src/utils/deepLinks.ts": "Builds, parses, and clears deep‑link URLs for songs using query or hash routing.",
  "frontend/src/utils/download.ts": "Provides helpers to validate audio URLs, generate filenames, and trigger audio file downloads.",
  "frontend/src/utils/offlineAudioCache.ts": "Manages optional offline caching of audio files via the Cache API.",
  "frontend/src/utils/share.ts": "Wraps Web Share API and clipboard operations for sharing song links or text.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL parameters or hash query params, persisting them in sessionStorage, and clearing them from the URL.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom color system, animations, and typography/container/animate plugins.",
  "project_state.json": "Project state descriptor outlining build goals, UI specs, themes, image requirements, and known issues for the MVRIO Night PWA."
}