{
  "backend/main.mo": "Main canister actor implementing access control, user profiles, song management, likes, play counts, favorites, and playlist storage with admin passcode gating.",
  "backend/migration.mo": "Migration module that maps old official playlists to the new format during canister upgrades.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend source files.",
  "frontend/index.css": "Tailwind base/theme variables and dark-mode styles defining global color tokens and layout primitives.",
  "frontend/index.html": "HTML entry point loading the root element and main TypeScript bundle.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining name, icons, theme colors, start URL, and categories.",
  "frontend/public/service-worker.js": "Service worker handling app shell caching and special logic for audio request caching.",
  "frontend/src/App.tsx": "Main React app wiring providers, navigation, deep links, welcome popup, admin mode, and screen rendering.",
  "frontend/src/components/admin/AdminPasscodeModal.tsx": "Dialog for enabling or disabling admin mode via passcode, with validation and error handling.",
  "frontend/src/components/auth/AdminOnly.tsx": "Components that conditionally render or disable content based on admin status, optionally showing tooltips.",
  "frontend/src/components/branding/AppHeader.tsx": "App header displaying the logo and title with styled branding.",
  "frontend/src/components/home/HomeChannelBanner.tsx": "Admin‑editable banner component allowing file upload, URL input, and clearing of the home channel image.",
  "frontend/src/components/layout/AppShell.tsx": "Main app layout with starfield background, header, navigation, footer, and content container.",
  "frontend/src/components/library/LibraryPlaylistsPanel.tsx": "Panel listing user and official playlists with dialogs for creating new ones and auth/admin checks.",
  "frontend/src/components/library/LibraryTopTabs.tsx": "Tab selector switching between songs and playlists in the library view.",
  "frontend/src/components/library/PlaylistDetailView.tsx": "Displays playlist details, fetches songs for user or official playlists, and provides playback controls like play, shuffle, and repeat.",
  "frontend/src/components/navigation/BottomTabBar.tsx": "Renders a mobile bottom navigation bar with tabs and highlights the active screen.",
  "frontend/src/components/navigation/Sidebar.tsx": "Provides a slide-out sidebar menu with navigation links, install prompt, and login/logout actions.",
  "frontend/src/components/onboarding/FirstLaunchWelcomePopup.tsx": "Shows a welcome modal on first launch with options to continue as guest or sign in.",
  "frontend/src/components/player/MusicPlayer.tsx": "Audio player component that handles playback, progress, volume, and play count updates for the current song.",
  "frontend/src/components/pwa/A2HSBanner.tsx": "Displays a dismissible banner prompting users to install the PWA and hides after dismissal.",
  "frontend/src/components/SignInModal.tsx": "Mobile/desktop modal for signing in with Internet Identity, handling login, cancel, and loading states.",
  "frontend/src/components/songs/CreatePlaylistDialog.tsx": "Dialog for creating a playlist and adding a song to it, handling auth requirements and error states.",
  "frontend/src/components/songs/DownloadChooserDialog.tsx": "Responsive dialog/drawer offering offline caching or device download options for a song.",
  "frontend/src/components/songs/HorizontalSongCard.tsx": "Compact horizontal song card with artwork, play button, overflow menu, and engagement bar.",
  "frontend/src/components/songs/HorizontalSongRow.tsx": "Horizontal scrollable row that displays a titled list of song cards.",
  "frontend/src/components/songs/PlaylistChooserDialog.tsx": "Dialog/drawer allowing users to add or remove a song from their playlists with auth handling.",
  "frontend/src/components/songs/SongCard.tsx": "Grid-style song card with artwork, play/delete controls, and an engagement bar overlay.",
  "frontend/src/components/songs/SongEditor.tsx": "Admin-only dialog for creating new songs with file or URL uploads and form validation.",
  "frontend/src/components/songs/SongEngagementBar.tsx": "Displays like and play counts with an optional like button and compact mode.",
  "frontend/src/components/songs/SongListRow.tsx": "Row-style song item with artwork, play/delete controls, engagement bar, and overflow menu.",
  "frontend/src/components/songs/SongOverflowMenu.tsx": "Provides a mobile/desktop overflow menu for song actions like favoriting, playlist management, downloads, sharing, and offline caching with auth handling.",
  "frontend/src/components/songs/SongsSortBar.tsx": "Renders a simple select control allowing users to choose how songs are sorted.",
  "frontend/src/components/visual/StarfieldBackground.tsx": "Creates an animated starfield background in dark mode using DOM elements and optional reduced animations.",
  "frontend/src/config/featureFlags.ts": "Defines feature flags, currently enabling desktop bottom tab bar behavior.",
  "frontend/src/context/AdminContext.tsx": "Provides admin-mode state derived from HiddenAdminMode, exposing isAdmin without async loading.",
  "frontend/src/context/AuthContext.tsx": "Manages authentication state, sign-in modal, and pending user actions requiring auth.",
  "frontend/src/context/HiddenAdminModeContext.tsx": "Implements a hidden admin mode unlocked by passcode, stored in sessionStorage, with modal controls.",
  "frontend/src/hooks/useA2HS.ts": "Handles Add-to-Home-Screen install prompt events and exposes method to trigger installation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing queries when identity changes.",
  "frontend/src/hooks/useFirstLaunchWelcome.ts": "Tracks whether the app's first-launch welcome screen should be shown using localStorage.",
  "frontend/src/hooks/useHomeBanner.ts": "Manages home banner image state with persistence, validation, and fallback defaults.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity integration, including login, logout, identity loading, and status tracking.",
  "frontend/src/hooks/useIsAdmin.ts": "Deprecated hook that always returns non-admin state for backward compatibility.",
  "frontend/src/hooks/useLikedSongs.ts": "Provides liked-song lookup using user identity and favorites, returning helpers and a Set of song IDs.",
  "frontend/src/hooks/useMediaQuery.ts": "Tracks viewport match for a media query and includes a mobile-specific helper.",
  "frontend/src/hooks/usePendingAction.ts": "Executes deferred user actions after authentication, handling likes, playlists, downloads, and error cases.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating songs and playlists with admin-mode checks and asset handling.",
  "frontend/src/hooks/useSettings.ts": "Context for user settings with persistence to localStorage and UI updates such as reduced animations.",
  "frontend/src/hooks/useSongEngagement.ts": "Handles liking and playing songs with authentication checks and soft sign‑in fallback.",
  "frontend/src/hooks/useTheme.ts": "Theme context storing light/dark mode with persistence and DOM class updates.",
  "frontend/src/index.css": "Tailwind setup defining light/dark design tokens, global styles, and animation reduction behavior.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and Internet Identity providers.",
  "frontend/src/pages/AboutArtistScreen.tsx": "Displays artist information and external links to social profiles.",
  "frontend/src/pages/ContactScreen.tsx": "Contact page offering a description and an email link for inquiries.",
  "frontend/src/pages/CustomSongRequestsScreen.tsx": "Explains custom song request offerings and provides coffee/support and email contact links.",
  "frontend/src/pages/HomeScreen.tsx": "Home screen fetching songs, managing playback state, showing new and top songs, and supporting admin deletion.",
  "frontend/src/pages/LibraryScreen.tsx": "Library screen handling tabs, playlists, favorites, and playlist-aware music playback with shuffle and repeat.",
  "frontend/src/pages/SearchScreen.tsx": "Search interface that queries songs by keyword and provides playback of search results.",
  "frontend/src/pages/SettingsScreen.tsx": "Settings page allowing users to configure audio quality, animations, visual effects, and notifications.",
  "frontend/src/pages/SongsScreen.tsx": "Song list screen with sorting options, music playback, deep-link handling, and admin song deletion.",
  "frontend/src/pages/SupportScreen.tsx": "Support page encouraging user donations with a link to Buy Me a Coffee.",
  "frontend/src/pages/ThemesScreen.tsx": "Theme selection page for switching between dark and light modes.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker on page load for PWA support.",
  "frontend/src/utils/authorizationErrors.ts": "Parses backend errors to identify admin or sign‑in authorization issues and provides user‑friendly messages and helpers.",
  "frontend/src/utils/dataUrl.ts": "Detects data URLs and converts them into byte arrays for blob handling.",
  "frontend/src/utils/deepLinks.ts": "Builds, parses, and clears song deep‑link parameters using query or hash routing.",
  "frontend/src/utils/download.ts": "Validates audio URLs, generates safe filenames, and triggers browser downloads for songs.",
  "frontend/src/utils/offlineAudioCache.ts": "Caches, checks, removes, and clears audio files using the browser Cache API for offline playback.",
  "frontend/src/utils/playlistPlayback.ts": "Provides shuffle, next/previous index logic with repeat support, and song lookup by ID.",
  "frontend/src/utils/share.ts": "Supports sharing via Web Share API or clipboard with fallbacks.",
  "frontend/src/utils/songSort.ts": "Implements deterministic sorting of songs by newest, top liked, or most heard.",
  "frontend/src/utils/urlParams.ts": "Retrieves, stores, persists, and clears URL parameters across query and hash routing using sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, container settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines project state and requirements for the MVRIO Night PWA, including UI rules, authentication and guest mode behavior, admin-mode design, and known issues. Contains architectural notes and versioning metadata for planning and builds."
}