{
  "backend/main.mo": "Core Motoko canister managing user profiles, songs with metadata and media blobs, likes and play counts, and user/official playlists with access control.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected files, components, and tests for authentication, sign‑in modal, and pending‑action systems.",
  "frontend-file-summaries.txt": "Prewritten summaries describing each frontend file’s purpose across layout, hooks, components, and screens.",
  "frontend/index.css": "Tailwind base/theme setup defining OKLCH variables for light/dark modes and applying global background and text styles.",
  "frontend/index.html": "Root HTML document loading the app with manifest, icons, metadata, and mounting point for React.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, icons, theme colors, display mode, and categories.",
  "frontend/public/service-worker.js": "Service worker handling install, cache cleanup, and fetch strategies with special handling for audio requests.",
  "frontend/src/App.tsx": "Main React app wiring providers, screen navigation, deep link handling, welcome popup, pending action hook, and SignInModal.",
  "frontend/src/components/branding/AppHeader.tsx": "Header displaying the app logo, title, and subtitle with styling.",
  "frontend/src/components/home/HomeChannelBanner.tsx": "Banner editor allowing users to upload, link, or clear a custom channel image with preview and notifications.",
  "frontend/src/components/layout/AppShell.tsx": "Main layout wrapper with header, sidebar, starfield background, footer, and bottom tab bar.",
  "frontend/src/components/library/LibraryPlaylistsPanel.tsx": "Playlist management panel enabling viewing and creating playlists with auth handling and dialogs.",
  "frontend/src/components/library/LibraryTopTabs.tsx": "Simple tab selector for switching between songs and playlists in the library.",
  "frontend/src/components/navigation/BottomTabBar.tsx": "Bottom navigation bar with tabs for main screens and active-state styling.",
  "frontend/src/components/navigation/Sidebar.tsx": "Sidebar navigation menu for desktop and mobile with install prompt support.",
  "frontend/src/components/onboarding/FirstLaunchWelcomePopup.tsx": "Welcome popup for first-time users offering guest mode or Internet Identity sign‑in.",
  "frontend/src/components/player/MusicPlayer.tsx": "Audio player component handling playback, seeking, volume, play count updates, and next/previous navigation.",
  "frontend/src/components/pwa/A2HSBanner.tsx": "Displays an install prompt banner for adding the PWA to the home screen with dismiss persistence.",
  "frontend/src/components/SignInModal.tsx": "Responsive sign‑in modal/drawer that triggers Internet Identity login and handles cancel logic.",
  "frontend/src/components/songs/CreatePlaylistDialog.tsx": "Dialog/drawer for creating a playlist and adding a song, with auth handling and async mutations.",
  "frontend/src/components/songs/DownloadChooserDialog.tsx": "Dialog/drawer offering offline caching or direct device download options for a song.",
  "frontend/src/components/songs/HorizontalSongCard.tsx": "Compact horizontal song card with artwork, play button, and engagement bar.",
  "frontend/src/components/songs/HorizontalSongRow.tsx": "Scrollable horizontal row displaying a titled collection of song cards.",
  "frontend/src/components/songs/PlaylistChooserDialog.tsx": "Dialog/drawer allowing users to toggle song membership in playlists with auth and loading states.",
  "frontend/src/components/songs/SongCard.tsx": "Song card with artwork, play, delete, and overflow actions plus engagement info.",
  "frontend/src/components/songs/SongEditor.tsx": "Dialog-based form for adding songs with file-to-DataURL handling, validation, and submission via useAddSong.",
  "frontend/src/components/songs/SongEngagementBar.tsx": "Displays like and play counts with optional like button using useSongEngagement.",
  "frontend/src/components/songs/SongListRow.tsx": "Renders a song row with artwork, play/delete controls, and engagement bar.",
  "frontend/src/components/songs/SongOverflowMenu.tsx": "Provides song actions like favorites, playlists, downloads, and sharing with auth checks and mobile drawer support.",
  "frontend/src/components/songs/SongsSortBar.tsx": "Sort selector allowing users to choose latest, most liked, or most heard.",
  "frontend/src/components/visual/StarfieldBackground.tsx": "Generates an animated starfield in dark mode using DOM elements and settings.",
  "frontend/src/config/featureFlags.ts": "Defines feature flags, currently enabling desktop bottom tab bar.",
  "frontend/src/context/AuthContext.tsx": "Auth context managing authentication state, pending actions, and sign‑in modal workflow.",
  "frontend/src/hooks/useA2HS.ts": "Hook detecting A2HS installability and managing deferred install prompt.",
  "frontend/src/hooks/useActor.ts": "Creates and manages authenticated or anonymous backend actors with query invalidation on identity change.",
  "frontend/src/hooks/useFirstLaunchWelcome.ts": "Tracks and shows a first‑launch welcome modal using localStorage.",
  "frontend/src/hooks/useHomeBanner.ts": "Manages home banner image state with localStorage persistence and supports URL or file uploads.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identity restoration, and status tracking.",
  "frontend/src/hooks/useMediaQuery.ts": "Offers hooks to check media query matches and detect mobile viewport.",
  "frontend/src/hooks/usePendingAction.ts": "Executes deferred user actions after authentication and handles retries or errors.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for song and playlist operations backed by the actor API.",
  "frontend/src/hooks/useSettings.ts": "Stores and updates user settings with localStorage sync and UI effects such as reduced animations.",
  "frontend/src/hooks/useSongEngagement.ts": "Handles liking and playing songs, triggering auth when necessary.",
  "frontend/src/hooks/useTheme.ts": "Manages light/dark theme state with persistence and DOM class updates.",
  "frontend/src/index.css": "Tailwind setup plus extensive light/dark CSS variables and global UI styling.",
  "frontend/src/main.tsx": "App entry point that mounts React with query and identity providers.",
  "frontend/src/pages/AboutArtistScreen.tsx": "Displays an artist bio with social links and support buttons.",
  "frontend/src/pages/ContactScreen.tsx": "Shows contact info and a button to email the artist.",
  "frontend/src/pages/CustomSongRequestsScreen.tsx": "Explains custom song requests and provides support and email links.",
  "frontend/src/pages/HomeScreen.tsx": "Loads all songs, shows new/top sections, provides playback controls, and manages song deletion.",
  "frontend/src/pages/LibraryScreen.tsx": "Displays the user's library with tabs for songs and playlists plus an integrated music player.",
  "frontend/src/pages/SearchScreen.tsx": "Allows song searching with live results and a music player for search matches.",
  "frontend/src/pages/SettingsScreen.tsx": "Provides UI for changing audio, visual, and notification settings using switches and selects.",
  "frontend/src/pages/SongsScreen.tsx": "Shows all songs with sorting, deletion, deep-link handling, and a music player.",
  "frontend/src/pages/SupportScreen.tsx": "Displays a support page with a card encouraging donations via Buy Me a Coffee.",
  "frontend/src/pages/ThemesScreen.tsx": "Provides UI for switching between dark and light themes using buttons and icons.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker on window load and logs success or failure.",
  "frontend/src/utils/deepLinks.ts": "Creates, parses, and clears song deep-link URL parameters for hash and query routing.",
  "frontend/src/utils/download.ts": "Provides helpers for validating audio URLs, generating filenames, and triggering song downloads.",
  "frontend/src/utils/offlineAudioCache.ts": "Implements caching, checking, removing, and clearing of offline audio files using the Cache API.",
  "frontend/src/utils/share.ts": "Offers Web Share API helpers and clipboard fallback for sharing text or song links.",
  "frontend/src/utils/urlParams.ts": "Retrieves, stores, persists, and clears URL parameters across query and hash routing using sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, animations, and plugins for styling.",
  "project_state.json": "Defines current project version and detailed requirements for the MVRIO Night PWA, including UI rules, authentication flow, A2HS behavior, and navigation/theme specifications. Lists architectural notes and known issues affecting builds and UI color behavior."
}