{
  "backend/main.mo": "Motoko canister managing access control, user profiles, listening time, and song/playlist storage with admin features.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and test references.",
  "frontend-file-summaries.txt": "Text file containing high‑level summaries of various frontend source files.",
  "frontend/index.css": "Tailwind base theme tokens for light and dark modes using OKLCH values.",
  "frontend/index.html": "HTML entry point loading the React app and manifest.",
  "frontend/public/a2hs-beforeinstallprompt-snippet.html": "Standalone demo page showing a styled beforeinstallprompt Add to Home Screen flow.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining icons, theme, start URL, and display mode.",
  "frontend/public/service-worker.js": "Service worker caching app shell and handling audio requests with a custom offline strategy.",
  "frontend/src/App.tsx": "Main app container managing screen routing, deep links, authentication state, messaging drawer, and onboarding modals. Coordinates providers and renders feature screens based on app state.",
  "frontend/src/components/account/ProfileCompletionModal.tsx": "Modal requiring users to complete profile fields and submit them, with basic validation and profile-saving logic.",
  "frontend/src/components/admin/AboutArtistProfileEditor.tsx": "Admin editor for the artist profile, allowing viewing, editing, validating, and saving artist bio and links.",
  "frontend/src/components/admin/AdminPasscodeModal.tsx": "Modal for entering or disabling an admin passcode to toggle hidden admin mode, with validation and error handling.",
  "frontend/src/components/auth/AdminOnly.tsx": "Components that conditionally render or disable UI based on admin status, with optional fallback or tooltip behavior.",
  "frontend/src/components/branding/AppHeader.tsx": "App header showing branding and a messages button with unread indicator for authenticated users.",
  "frontend/src/components/home/HomeChannelBanner.tsx": "Displays the home banner with admin-only controls for uploading, setting, or clearing a custom image, plus long-press to open hidden admin mode.",
  "frontend/src/components/layout/AppShell.tsx": "Provides the main app layout with header, sidebar, starfield background, bottom tab bar, and routed content area.",
  "frontend/src/components/library/DeletePlaylistConfirmDialog.tsx": "Renders a confirmation dialog for deleting user or official playlists, showing a loading state while pending.",
  "frontend/src/components/library/LibraryPlaylistsPanel.tsx": "Manages user and official playlists including creation, deletion, listing, and opening playlist details with auth handling.",
  "frontend/src/components/library/LibraryTopTabs.tsx": "Simple tab switcher for toggling between songs and playlists in the library.",
  "frontend/src/components/library/PlaylistDetailView.tsx": "Shows playlist details, loads songs, and provides playback controls like play, shuffle, repeat, and song selection.",
  "frontend/src/components/messaging/AdminConversationList.tsx": "Displays all user conversations for admins with user profiles, selection handling, and delete confirmation.",
  "frontend/src/components/messaging/AdminInboxDrawer.tsx": "Empty file or placeholder for future admin inbox drawer implementation.",
  "frontend/src/components/messaging/AttachmentPicker.tsx": "Allows selecting and validating image, audio, or PDF attachments for messages with removal controls and error handling.",
  "frontend/src/components/messaging/DeleteConversationConfirmDialog.tsx": "Provides a confirmation dialog to delete a conversation and triggers a delete mutation when confirmed.",
  "frontend/src/components/messaging/MarioAvatar.tsx": "Renders a Mario-themed avatar using the home banner image with size options and a fallback icon.",
  "frontend/src/components/messaging/MarioStatusPill.tsx": "Displays a small online/offline pill indicating whether hidden admin mode is enabled.",
  "frontend/src/components/messaging/MessageComposerForm.tsx": "Form for composing and sending messages or custom song requests with optional attachments and validation.",
  "frontend/src/components/messaging/MessageThread.tsx": "Displays a list of messages with sender labeling, attachments, delete options, and seen indicators.",
  "frontend/src/components/messaging/UnifiedMessagesDrawer.tsx": "Drawer combining user and admin messaging views, handling message retrieval, sending, deletion, and seen-state updates.",
  "frontend/src/components/messaging/UserMessagesDrawer.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/navigation/BottomTabBar.tsx": "Mobile bottom navigation bar with icons for switching between core app screens.",
  "frontend/src/components/navigation/Sidebar.tsx": "Slide-out sidebar providing navigation, authentication controls, install prompts, and user profile details when signed in.",
  "frontend/src/components/onboarding/FirstLaunchWelcomePopup.tsx": "Welcome dialog prompting users to sign in with Internet Identity on first launch.",
  "frontend/src/components/player/MusicPlayer.tsx": "React audio player managing playback, progress, volume, and authenticated listening-time tracking. Integrates mutations for play counts and accumulated listening time with next/previous navigation.",
  "frontend/src/components/pwa/A2HSBanner.behavior.md": "Documentation describing rules for when the A2HS banner appears, hides, and persists session state. Notes that recent changes do not alter the banner’s behavior.",
  "frontend/src/components/pwa/A2HSBanner.tsx": "Component showing a PWA install banner based on install availability and sessionStorage state. Handles install prompt triggering and manual dismissal.",
  "frontend/src/components/SignInModal.tsx": "A modal or drawer prompting users to sign in via Internet Identity, handling login retries, cancellation, and pending actions.",
  "frontend/src/components/songs/CreatePlaylistDialog.tsx": "Dialog or drawer for creating a playlist and adding a song to it, with auth checks and mutation handling. Validates name input and displays success or error toasts.",
  "frontend/src/components/songs/DownloadChooserDialog.tsx": "Dialog or drawer letting users choose between offline app caching or device download. Renders two action buttons with loading support.",
  "frontend/src/components/songs/HorizontalSongCard.tsx": "Compact horizontal song card displaying cover art, metadata, play button, and overflow menu. Supports play interaction and engagement bar.",
  "frontend/src/components/songs/HorizontalSongRow.tsx": "Scrollable horizontal row wrapper for song cards with a section title. Provides horizontal scrolling via ScrollArea and ScrollBar.",
  "frontend/src/components/songs/PlaylistChooserDialog.tsx": "Dialog or drawer for adding or removing a song from user playlists with auth handling. Loads playlists, toggles membership, and shows toasts for updates.",
  "frontend/src/components/songs/SongCard.tsx": "Grid-style song card showing artwork, metadata, play button, engagement bar, and optional delete action. Supports fallback image handling and overflow menu.",
  "frontend/src/components/songs/SongEditor.tsx": "Admin-only modal form for adding songs with file/URL uploads, validation, and mutation submission.",
  "frontend/src/components/songs/SongEngagementBar.tsx": "Displays like and play counts with optional like button handling user interactions.",
  "frontend/src/components/songs/SongListRow.tsx": "Renders a clickable song row with artwork, metadata, engagement bar, play button, and overflow actions.",
  "frontend/src/components/songs/SongOverflowMenu.tsx": "Provides a dropdown/drawer menu for song actions like favorites, playlists, sharing, and downloads with auth checks.",
  "frontend/src/components/songs/SongsSortBar.tsx": "Simple select control for choosing the song sorting mode.",
  "frontend/src/components/visual/StarfieldBackground.tsx": "Generates an animated starfield background in dark mode with reduced-motion support.",
  "frontend/src/config/featureFlags.ts": "Defines feature flags, currently enabling desktop bottom tab bar behavior.",
  "frontend/src/context/AdminContext.tsx": "Exposes admin mode state derived from hidden admin mode with no async loading.",
  "frontend/src/context/AuthContext.tsx": "Manages authentication state, pending actions, and sign‑in modal behavior for protected features.",
  "frontend/src/context/HiddenAdminModeContext.tsx": "Implements hidden admin mode with passcode, session storage persistence, and activation via keyboard shortcut.",
  "frontend/src/hooks/useA2HS.ts": "Manages PWA install prompt events and exposes flags and a function to trigger installation.",
  "frontend/src/hooks/useActor.ts": "Creates and refreshes a backend actor based on identity changes and invalidates dependent queries.",
  "frontend/src/hooks/useFirstLaunchWelcome.ts": "Tracks whether a first‑launch welcome modal should be shown using localStorage.",
  "frontend/src/hooks/useHomeBanner.ts": "Stores and updates a customizable home banner image in localStorage with file validation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, including login, logout, and identity loading.",
  "frontend/src/hooks/useIsAdmin.ts": "Deprecated hook that always reports no admin access.",
  "frontend/src/hooks/useLikedSongs.ts": "Returns liked song IDs for the authenticated user and a helper to check if a song is liked.",
  "frontend/src/hooks/useListeningTime.ts": "Mutation hook that adds listening time via the backend actor and refreshes the user profile.",
  "frontend/src/hooks/useLongPress.ts": "Implements long‑press detection with movement tolerance using pointer events.",
  "frontend/src/hooks/useMediaQuery.ts": "Evaluates a media query and provides a mobile‑specific helper hook.",
  "frontend/src/hooks/useMessaging.ts": "Provides queries and mutations for user messaging, including sending attachments and managing messages.",
  "frontend/src/hooks/usePendingAction.ts": "Executes queued user actions after authentication, handling likes, favorites, playlist actions, caching, and downloads with toast feedback.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating songs, playlists, and artist data, including admin-gated song uploads and deletions.",
  "frontend/src/hooks/useSettings.ts": "Manages app settings stored in localStorage, exposing a context for updating preferences like audio quality and animation reduction.",
  "frontend/src/hooks/useSongEngagement.ts": "Handles song likes and play tracking, triggering auth flow when required and delegating mutations to query hooks.",
  "frontend/src/hooks/useTheme.ts": "Provides theme state and persistence, enabling toggling between light and dark modes via context.",
  "frontend/src/hooks/useUserProfile.ts": "Fetches and updates the caller's user profile with React Query, and includes helpers for completeness checks and listening-time formatting.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light and dark themes, plus animation and input appearance rules.",
  "frontend/src/main.tsx": "Initializes the React app, setting up QueryClient and Internet Identity providers before rendering App.",
  "frontend/src/pages/AboutArtistScreen.tsx": "Displays the artist's profile with social links and an optional admin editor, falling back to defaults when profile data is missing.",
  "frontend/src/pages/ContactScreen.tsx": "Renders a contact page with buttons to open the messaging interface and explains message and song request options.",
  "frontend/src/pages/CustomSongRequestsScreen.tsx": "Empty placeholder file with no implemented content.",
  "frontend/src/pages/HomeScreen.tsx": "Displays home view with song lists, music player, sorting, and admin deletion support.",
  "frontend/src/pages/LibraryScreen.tsx": "Manages library tabs, favorites, playlists, and music playback with queue, shuffle, and repeat logic.",
  "frontend/src/pages/SearchScreen.tsx": "Provides keyword song search with results grid and integrated music player.",
  "frontend/src/pages/SettingsScreen.tsx": "Shows configurable audio, visual, and notification settings using various UI controls.",
  "frontend/src/pages/SongsScreen.tsx": "Lists all songs with sorting, playback, and admin delete capabilities plus deep-link handling.",
  "frontend/src/pages/SupportScreen.tsx": "Displays support info and link for donations via Buy Me a Coffee.",
  "frontend/src/pages/ThemesScreen.tsx": "Provides a UI screen for switching between light and dark themes using buttons and visual highlights.",
  "frontend/src/pwa/registerServiceWorker.ts": "Registers the service worker on page load and logs success or failure.",
  "frontend/src/utils/artistProfileValidation.ts": "Validates artist profile URLs and returns field-level errors plus helpers to detect if any errors exist.",
  "frontend/src/utils/authorizationErrors.ts": "Maps authentication and admin-related errors to user-friendly messages and offers helpers to classify error types.",
  "frontend/src/utils/dataUrl.ts": "Detects data URLs and converts base64-encoded data URLs into byte arrays.",
  "frontend/src/utils/deepLinks.ts": "Builds, parses, and clears song deep-link URLs using query or hash routing.",
  "frontend/src/utils/download.ts": "Validates audio URLs, generates safe filenames, and triggers browser-based downloads for songs.",
  "frontend/src/utils/messagingAttachments.ts": "Validates message attachment files by type and size and converts File objects to byte arrays.",
  "frontend/src/utils/offlineAudioCache.ts": "Manages offline caching of audio files, including adding, checking, removing, and clearing cached audio.",
  "frontend/src/utils/playlistPlayback.ts": "Provides playlist utilities like shuffle, next/previous index handling, and finding songs by ID.",
  "frontend/src/utils/share.ts": "Supports sharing via Web Share API or clipboard with fallbacks for older browsers.",
  "frontend/src/utils/songSort.ts": "Implements deterministic sorting of songs by newest, top liked, or most heard with tie‑breakers.",
  "frontend/src/utils/structuredMessageFormat.ts": "Formats normal messages and custom song requests into structured, readable text blocks.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters, persisting them in sessionStorage, and clearing them from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, radii, shadows, animations, and enabling typography, container queries, and animation plugins.",
  "project_state.json": "Stores project metadata, current feature scope, architectural notes, and known issues for the system."
}