{
  "kind": "build_request",
  "title": "Playlist detail screen, Spotify-like playlist controls, and Admin-only Create Official Playlist",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-130",
      "text": "Make each playlist card in Library → Playlists fully clickable so clicking/tapping the card opens a dedicated playlist detail view that shows the songs inside that playlist.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Make each playlist card clickable. When clicked, it opens a page showing all songs in that playlist."
        ]
      },
      "acceptanceCriteria": [
        "In Library → Playlists, clicking a playlist card opens a playlist detail view without triggering any unintended playback.",
        "The playlist detail view shows the playlist name and a list of songs contained in that playlist.",
        "A clear Back control returns the user to the Library → Playlists list with the prior tab selection preserved."
      ]
    },
    {
      "id": "REQ-131",
      "text": "Implement the playlist detail view to render all songs in the playlist using existing song row components and existing playback behavior, so that selecting a song from the playlist starts playback in the existing MusicPlayer within the playlist context.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "...opens a page showing all songs in that playlist."
        ]
      },
      "acceptanceCriteria": [
        "Playlist detail song list renders using the existing Song UI patterns (e.g., SongListRow) including title image/title and the existing per-song controls (play/⋮/like) where applicable.",
        "Clicking a song row in the playlist detail view starts playback using the existing player behavior (no new audio implementation).",
        "Next/Previous from the MusicPlayer navigates within the playlist’s song list while the playlist detail view is open."
      ]
    },
    {
      "id": "REQ-132",
      "text": "On the playlist detail view, add a playlist-level Play button and Spotify-like controls for Shuffle, Repeat, and Play Mode; these controls must affect the playlist’s playback order when using Next/Previous and when starting playback from the playlist-level Play button.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "On the playlist page, add a Play button with controls: Shuffle, Repeat, and Play Modes like Spotify."
        ]
      },
      "acceptanceCriteria": [
        "Playlist detail view includes a prominent Play button plus distinct controls labeled or iconified for Shuffle, Repeat, and Play Mode.",
        "Toggling Shuffle changes the order used when starting playlist playback from the Play button and when navigating Next/Previous.",
        "Repeat control supports at minimum Off and Repeat All for playlist playback behavior within the playlist detail view.",
        "Play Mode control is present and changes playback behavior/state in a visible way (e.g., a dropdown or cycle button) without breaking existing player UI or other screens.",
        "All user-facing labels for these controls are in English."
      ]
    },
    {
      "id": "REQ-133",
      "text": "Add an Admin-Mode-only “Create Official Playlist” button in Library → Playlists, positioned beside the “Official Playlists” section header; it must only appear when Hidden Admin Mode is enabled and must not be visible to normal users or guests.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Add a ‘Create Official Playlist’ button that only appears for admins when Hidden Admin Mode is enabled. Normal users can create their own playlists but cannot see or use the official playlist button."
        ]
      },
      "acceptanceCriteria": [
        "When Hidden Admin Mode is disabled, the “Create Official Playlist” button is not rendered anywhere in the Library UI.",
        "When Hidden Admin Mode is enabled, the “Create Official Playlist” button is rendered beside the “Official Playlists” header in Library → Playlists.",
        "Normal users (not in Hidden Admin Mode) can still create their own playlists via the existing “Create Playlist” flow and cannot see the official playlist creation control.",
        "Clicking “Create Official Playlist” opens a dialog to enter a playlist name and confirms creation with an English success toast; errors show an English failure toast."
      ]
    },
    {
      "id": "REQ-134",
      "text": "Support listing and opening Official Playlists: show a real list of official playlists in the “Official Playlists” section, allow clicking an official playlist card to open the same playlist detail view, and load its songs using backend APIs intended for official playlists.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "...can go throught inside and see the songs added in the play list...",
          "...inside library -> playlist -> side of the offical play list"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a query method to list all official playlists (names + songIds) so the frontend can render the “Official Playlists” section without hardcoded placeholders.",
        "Frontend renders official playlist cards with name + song count in the “Official Playlists” section.",
        "Clicking an official playlist card opens the playlist detail view and displays the songs for that official playlist using the backend’s official-playlist details API.",
        "Guests can view official playlists and their contents (read-only) without being forced into sign-in, while user playlists remain restricted to signed-in users per existing authorization behavior."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Keep the existing BottomTabBar/Sidebar navigation behavior intact (no breaking changes to current screen switching).",
    "Use English for all user-facing text.",
    "Preserve existing authentication rules: user playlists and playlist mutations require Internet Identity; official playlist reads remain accessible to guests.",
    "Do not introduce additional backend services or databases; keep Motoko single-actor architecture (all logic in backend/main.mo)."
  ],
  "nonGoals": [
    "Implementing real audio queue persistence across app restarts for playlist playback.",
    "Adding collaborative playlists or sharing playlists between users.",
    "Adding playlist artwork upload/editing beyond what already exists.",
    "Changing existing song playback UI outside what is necessary to support playlist-context next/previous ordering."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}