{
  "kind": "build_request",
  "title": "Add 5-second long-press Home banner trigger for Hidden Admin Mode passcode modal",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-191",
      "text": "Implement an additional Hidden Admin Mode activation method: a press-and-hold (long-press) gesture on the Home channel banner image area that, after a continuous 5 seconds, opens the existing Admin passcode modal (the same modal used by the Ctrl+Shift+U shortcut) so the admin can enter the existing passcode and enable Admin Mode. This long-press trigger must work on both mobile (touch) and desktop (mouse/pointer), must not replace or modify the existing Ctrl+Shift+U shortcut behavior, and must not interfere with normal song playback/navigation interactions elsewhere on the Home screen.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-5",
          "msg-7"
        ],
        "quotes": [
          "to activate admin mode in mobile a altanative , admin has to click on the banner image and hold for 5 sec then the password bar appears so , admin can input the password and turn on admin mode",
          "1. no it's an additional way , and keep the cntl + shift + u shortcut . 2. can work in both but it's important in mobile . 3. yeah , same password",
          "build it now"
        ]
      },
      "acceptanceCriteria": [
        "On mobile, pressing and holding on the Home banner image continuously for 5 seconds opens the existing Admin passcode modal (no navigation).",
        "On desktop, clicking and holding on the Home banner image continuously for 5 seconds opens the existing Admin passcode modal (no navigation).",
        "Releasing early, moving pointer/finger off the banner, or canceling the gesture prevents the modal from opening.",
        "The existing Ctrl+Shift+U shortcut continues to open the same Admin passcode modal exactly as before.",
        "The passcode flow remains unchanged: the modal still accepts the same passcode and enables/disables Admin Mode using the existing Hidden Admin Mode logic.",
        "No new admin-only UI controls become visible unless Admin Mode is enabled; the long-press only opens the passcode modal."
      ]
    }
  ],
  "constraints": [
    "Do not edit any frontend files under the immutable paths listed in SYSTEM_CONTEXT (compose and integrate via non-immutable components/hooks only).",
    "Keep all user-facing text in English.",
    "Do not change the existing Ctrl+Shift+U Hidden Admin Mode activation flow; add long-press as an additional trigger only.",
    "Do not change the admin passcode value or modal copy/labels beyond what is necessary to wire in the new trigger."
  ],
  "nonGoals": [
    "Replacing the Ctrl+Shift+U shortcut with long-press.",
    "Changing the passcode or introducing a new admin credential scheme.",
    "Adding new admin UI features beyond opening the existing passcode modal from a long-press gesture.",
    "Backend changes or state migrations for this request."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}