{
  "kind": "build_request",
  "title": "Implement Admin/Artist role allowlist with backend enforcement and frontend gating",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-100",
      "text": "Implement a hard-coded allowlist of Admin/Artist Principal IDs in the Motoko canister and expose a query method that returns whether the caller is an Admin/Artist.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Use a hard-coded list of admin Principal IDs in the backend canister. Any Principal ID in that list is treated as an Admin/Artist; all others are normal users."
        ]
      },
      "acceptanceCriteria": [
        "A hard-coded list/array of admin Principal IDs exists in the backend canister code (not user-editable at runtime).",
        "A new backend query method (e.g., `isCallerAdmin`) returns `true` if and only if `caller` is in the allowlist; otherwise `false` (including anonymous/guest).",
        "The method does not trap for guests; it returns `false` for non-authenticated callers."
      ]
    },
    {
      "id": "REQ-101",
      "text": "Enforce Admin/Artist-only permissions in the backend for all admin-only song management operations, so normal signed-in users cannot upload/add songs or delete songs.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Admin / Artist can create official playlists, add or delete songs, change app settings, update banners, and modify the layout.",
          "Normal users cannot make official playlists, edit songs, delete songs, or change app settings."
        ]
      },
      "acceptanceCriteria": [
        "Calling `addSong` as a non-admin authenticated user traps/returns an authorization error (consistent with current backend error patterns).",
        "Calling `deleteSong` as a non-admin authenticated user traps/returns an authorization error (even if they are the song owner).",
        "Calling `addSong` and `deleteSong` as an admin succeeds (assuming valid inputs and song exists for delete).",
        "Guest read-only operations (e.g., `getAllSongs`, `getSong`, `searchSongs`, `playSong`, and other existing read-only flows) continue to work without requiring admin or user permissions."
      ]
    },
    {
      "id": "REQ-102",
      "text": "Enforce Admin/Artist-only permissions in the backend for all official playlist management operations (create/add/remove), while keeping official playlist reads accessible to everyone.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Admin / Artist can create official playlists...",
          "Normal users cannot make official playlists..."
        ]
      },
      "acceptanceCriteria": [
        "Official playlist write operations (create/add/remove) require Admin/Artist per the allowlist and fail for non-admin users.",
        "Official playlist read operations (e.g., `getOfficialPlaylist`, `getOfficialPlaylistDetails`) remain available to guests and non-admin users and do not trap due to missing user permissions.",
        "No change in behavior for user-owned playlist CRUD permissions (still restricted to signed-in users only, and only operating on caller-owned playlists)."
      ]
    },
    {
      "id": "REQ-103",
      "text": "Add frontend role detection and caching so the React app can determine whether the currently signed-in identity is an Admin/Artist, without breaking guest mode.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Implement both frontend and backend checks so admin-only features are hidden or blocked for normal users."
        ]
      },
      "acceptanceCriteria": [
        "Frontend calls the backend admin-check query (from REQ-100) and derives an `isAdmin` boolean for the current session.",
        "When the user is signed out / in guest mode, `isAdmin` is treated as `false` and the app continues to function normally in read-only mode.",
        "Switching identities (sign in / sign out) correctly updates the derived `isAdmin` state and any dependent UI."
      ]
    },
    {
      "id": "REQ-104",
      "text": "Gate all admin-only UI entry points so Admin/Artist-only features are hidden or blocked for normal users: song upload/add, song delete, and Home banner editing controls.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Admin / Artist can... add or delete songs... update banners...",
          "Implement both frontend and backend checks so admin-only features are hidden or blocked for normal users."
        ]
      },
      "acceptanceCriteria": [
        "If the current user is not admin, all UI entry points that open/trigger song upload/add (e.g., the `SongEditor` trigger) are not shown or are disabled with clear feedback.",
        "If the current user is not admin, all UI entry points that delete songs (e.g., delete buttons on song cards/rows) are not shown or are disabled with clear feedback.",
        "If the current user is not admin, Home banner editing controls in `HomeChannelBanner` (upload, URL set, clear/reset) are not shown or are disabled with clear feedback; the banner display remains visible.",
        "If a non-admin user somehow triggers an admin-only action (e.g., stale UI state), the frontend shows an English error message (toast/dialog) such as \"Admin access required\" and does not crash.",
        "Admin users continue to see and use the admin-only controls as before."
      ]
    },
    {
      "id": "REQ-105",
      "text": "Ensure frontend error handling for admin-only operations properly interprets backend authorization failures and shows a clear English message for non-admin signed-in users, while preserving the existing soft sign-in modal flow for guest-only restrictions.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Normal users cannot make official playlists, edit songs, delete songs, or change app settings.",
          "Implement both frontend and backend checks so admin-only features are hidden or blocked for normal users."
        ]
      },
      "acceptanceCriteria": [
        "When a signed-in non-admin attempts an admin-only action and the backend returns an authorization error, the UI displays an English message indicating admin permission is required (and does not open the sign-in modal).",
        "When a guest attempts a sign-in-required (non-admin) restricted action (like creating a personal playlist, liking, favorites, downloads), the existing soft sign-in modal behavior remains unchanged.",
        "No infinite retry loops occur via pending-action retry for admin-only actions when the user is signed in but not admin."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in `backend/main.mo`; do not introduce additional canisters/services.",
    "Do not edit files under `frontend/src/components/ui` or other immutable paths listed in SYSTEM_CONTEXT.",
    "Do not remove or change existing guest read-only behaviors (browsing/searching/playing songs) beyond what is required for admin-only restrictions.",
    "Use English for all user-facing text added or changed."
  ],
  "nonGoals": [
    "Implementing a UI to edit the admin allowlist at runtime.",
    "Implementing third-party authentication or wallet integrations beyond the existing Internet Identity flow.",
    "Redesigning app-wide theming, navigation, or layout beyond gating admin-only controls.",
    "Adding new backend persistence for global app settings/layout (only gate existing UI controls as requested)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}