{
  "kind": "build_request",
  "title": "Fix mobile playlist Favorites persistence per user + make mobile playlist Share action work",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement backend support for playlist favorites saved per authenticated user (Internet Identity principal), including endpoints used by the frontend: `getPlaylistFavorites()` and `togglePlaylistFavorite(playlistName: Text)`.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Add to Favorites is failing because the playlist favorites backend is missing or broken. Fix it so playlist favorites are saved per user."
        ]
      },
      "acceptanceCriteria": [
        "Calling `getPlaylistFavorites()` as an authenticated user returns only that caller’s favorited playlist names.",
        "Calling `togglePlaylistFavorite(playlistName)` as an authenticated user adds/removes that playlist name for that caller and returns a boolean consistent with the frontend’s expectation (`wasRemoved`).",
        "Calls are authorized for any authenticated user (not admin-only); unauthenticated callers are rejected with an authorization error.",
        "Playlist favorites persist across subsequent reads for the same user (i.e., after page refresh/re-login)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Fix the mobile playlist Favorites UI so tapping “Add to Favorites” / “Remove from Favorites” in the mobile playlist overflow menu successfully saves per-user favorites via the backend and updates UI state.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "fix it now , only in the mobile"
        ]
      },
      "acceptanceCriteria": [
        "On mobile, tapping the Favorites action in `PlaylistOverflowMenu` toggles favorite state without requiring admin mode.",
        "If the user is signed out, tapping the Favorites action triggers the existing sign-in flow (pending action type `playlist-favorites`) and completes the toggle after successful sign-in.",
        "After toggling, the menu closes and the favorite state reflects the new value (including after navigating away and back)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Fix the mobile playlist Share action so it generates a playlist deep link using the same hash/query deep-link pattern used for songs (playlist instead of song) and allows users to share via native share sheet when supported, otherwise copies to clipboard, without redesigning the menu.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Share button is broken because no share logic is implemented. Generate a playlist deep link and allow users to copy or share it. IN MOBILE , fix it now",
          "Yes, the playlist deep-link must use the exact same hash/query deep-link pattern already used for songs, just pointing to a playlist instead of a song.",
          "Update the existing ⋮ menu UI only if needed to make the Share action actually work",
          "Do NOT redesign the menu unless required for functionality"
        ]
      },
      "acceptanceCriteria": [
        "On mobile, tapping “Share” in `PlaylistOverflowMenu` attempts to open the native share sheet using the Web Share API when available.",
        "If the Web Share API is unavailable or share fails (non-cancel), the deep link is copied to clipboard and a success/failure toast is shown.",
        "The deep link is hash-based and query-param driven, matching the app’s existing song deep-link style (e.g. `#/?playlist=<name>&playlistType=<user|official>`).",
        "No visual redesign of the existing overflow menu beyond changes strictly required to make the Share action function correctly."
      ]
    }
  ],
  "constraints": [
    "Apply fixes specifically to mobile behavior (do not introduce desktop-only changes beyond what is necessary to keep shared code working).",
    "Do not redesign the playlist overflow menu UI; only adjust for functionality.",
    "Do not edit files under frontend immutable paths (e.g., `frontend/src/hooks/useInternetIdentity.ts(x)`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, `frontend/src/components/ui`).",
    "User-facing text must be English."
  ],
  "nonGoals": [
    "Adding new social integrations beyond Web Share API and clipboard copying.",
    "Changing playlist deep-link format away from the existing hash/query pattern.",
    "Implementing sharing for songs (already exists) or adding new share destinations/UI beyond the existing Share action."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}