{
  "kind": "build_request",
  "title": "Restore header icon to neon-green music note (white outline) without changing header layout",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Replace the current header logo image in `frontend/src/components/branding/AppHeader.tsx` with a neon-green music note icon that has a white outline, while keeping the header’s existing sizing, alignment, spacing, and layout unchanged (do not change wrapper classes like `w-10 h-10`, padding, flex layout, or gaps).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-2"
        ],
        "quotes": [
          "yeah add that music icon as the header icon (neon green with white outline )",
          "build it now"
        ]
      },
      "acceptanceCriteria": [
        "The header icon renders as a neon-green music note with a white outline.",
        "The icon occupies the same space as before (same container size, same alignment, same spacing).",
        "No other header elements (title/subtitle/messages button/menu button) visually shift due to this change."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add the new music-note icon image as a static asset under `frontend/public/assets/generated/` and reference it directly from the header `<img src=...>` (do not route image loading through the backend).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "yeah add that music icon as the header icon (neon green with white outline )"
        ]
      },
      "acceptanceCriteria": [
        "A new PNG icon file exists at `frontend/public/assets/generated/` and is used by `AppHeader`.",
        "The header icon loads reliably (no broken image placeholder)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Do not modify navigation behavior or any other header functionality; only change the header icon image source to the new music-note icon.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-0"
        ],
        "quotes": [
          "Do NOT modify navigation or functionality."
        ]
      },
      "acceptanceCriteria": [
        "All header buttons (menu toggle if present, messages button) behave exactly as before.",
        "No routes, screen navigation, or click handlers are changed as part of this update."
      ]
    }
  ],
  "constraints": [
    "Do not change any other header layout beyond swapping the icon image source.",
    "Do not modify `frontend/src/hooks/useInternetIdentity.ts` / `frontend/src/hooks/useActor.ts` / `frontend/src/main.tsx` or anything in `frontend/src/components/ui` (immutable paths).",
    "Do not change PWA manifest icons or favicon unless explicitly required for the header icon swap."
  ],
  "nonGoals": [
    "Fixing the previously uploaded custom app icon display issue globally (outside of removing it from the header).",
    "Changing app name, header text, or overall branding theme.",
    "Adding new navigation items or altering sidebar behavior."
  ],
  "imageRequirements": {
    "required": [
      "Neon-green music note icon with white outline on transparent background (header-music-note.dim_128x128.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}