{
  "kind": "build_request",
  "title": "Enlarge Home banner area and overlay artist name “THE MVRIO” in neon green",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-92",
      "text": "Update the Home channel banner component so the banner area is larger (both wider and taller) while keeping the banner image fully visible at all times (no stretching and no cropping).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "1, both - don't strach or crop the image keep the original image  and make it larger in wide and tall"
        ]
      },
      "acceptanceCriteria": [
        "Home screen channel banner renders with a noticeably larger visual area than before on both mobile and desktop (increase height and maintain full-width layout).",
        "The banner image is never cropped and never stretched: it must remain fully visible within the banner area (e.g., object-contain behavior preserved).",
        "No layout collisions are introduced with the A2HS banner, header, or the content below the banner (content remains readable and spaced correctly)."
      ]
    },
    {
      "id": "REQ-93",
      "text": "Overlay the artist name text “THE MVRIO” on top of the Home channel banner inside the right-side region (the green-outlined area in the uploaded screenshots), styled using the app’s neon green theme color (#1ED760).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "2. in the green outline are",
          "3.neon green theme"
        ]
      },
      "acceptanceCriteria": [
        "The text “THE MVRIO” is visible on top of the banner image, positioned on the right side within the banner area (right-side box placement).",
        "The text color uses neon green (#1ED760) and remains readable on both themes/backgrounds.",
        "The overlay does not block or overlap the existing banner edit controls (upload/link/clear); controls remain clickable and visually accessible.",
        "The overlay is responsive: it stays within the banner area across common mobile and desktop widths without overflowing or being cut off."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be modified: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Keep the existing Home header (AppHeader) unchanged; only adjust the Home banner component/layout as needed.",
    "Do not introduce image cropping or stretching under any responsive breakpoint."
  ],
  "nonGoals": [
    "Do not change the banner image selection/storage behavior (upload/URL/localStorage) beyond what is required for sizing and overlay text.",
    "Do not change global theming rules, BottomTabBar behavior, sidebar behavior, or the A2HS banner behavior.",
    "Do not add new backend APIs or modify Motoko state for this change."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}