{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add 5-second long-press trigger on Home banner to open existing Admin passcode modal",
  "requirements": [
    {
      "id": "REQ-191",
      "summary": "Add a 5-second long-press gesture on the Home banner image area (touch + mouse/pointer) to open the existing Admin passcode modal without affecting the Ctrl+Shift+U shortcut or other Home interactions.",
      "acceptanceCriteria": [
        "On mobile, pressing and holding on the Home banner image continuously for 5 seconds opens the existing Admin passcode modal (no navigation).",
        "On desktop, clicking and holding on the Home banner image continuously for 5 seconds opens the existing Admin passcode modal (no navigation).",
        "Releasing early, moving pointer/finger off the banner, or canceling the gesture prevents the modal from opening.",
        "The existing Ctrl+Shift+U shortcut continues to open the same Admin passcode modal exactly as before.",
        "The passcode flow remains unchanged: the modal still accepts the same passcode and enables/disables Admin Mode using the existing Hidden Admin Mode logic.",
        "No new admin-only UI controls become visible unless Admin Mode is enabled; the long-press only opens the passcode modal."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useLongPress.ts",
          "operation": "create",
          "description": "Create a reusable React hook that detects a continuous long-press via Pointer Events (works for touch and mouse) with a configurable delay (5000ms), and exposes event handlers that properly cancel on pointerup, pointercancel, pointerleave, and significant movement so the action does not fire unless the press is uninterrupted for the full duration."
        },
        {
          "path": "frontend/src/components/home/HomeChannelBanner.tsx",
          "operation": "modify",
          "description": "Wrap the banner image area with long-press handlers (from useLongPress) and call useHiddenAdminMode().openModal() after an uninterrupted 5-second press; ensure the long-press is attached only to the banner image area (not the rest of the Home screen), cancels when the pointer/finger leaves the banner image area, and does not change existing admin controls visibility or the Ctrl+Shift+U activation behavior."
        }
      ]
    }
  ]
}