{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Resize Home banner area and add neon-green “THE MVRIO” overlay",
  "requirements": [
    {
      "id": "REQ-92",
      "summary": "Increase the Home channel banner’s visual area (wider/taller) while preserving full, uncropped, unstretched image visibility across breakpoints.",
      "acceptanceCriteria": [
        "Home screen channel banner renders with a noticeably larger visual area than before on both mobile and desktop (increase height and maintain full-width layout).",
        "The banner image is never cropped and never stretched: it must remain fully visible within the banner area (e.g., object-contain behavior preserved).",
        "No layout collisions are introduced with the A2HS banner, header, or the content below the banner (content remains readable and spaced correctly)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/home/HomeChannelBanner.tsx",
          "operation": "modify",
          "description": "Update the banner container sizing to be taller on mobile and desktop using responsive height/min-height (while keeping full-width layout). Keep the image rendered with object-contain and explicit w-full/h-full so it is never cropped or stretched, and verify spacing/margins so Home content below remains readable and does not collide with the A2HS banner or header."
        }
      ]
    },
    {
      "id": "REQ-93",
      "summary": "Overlay the artist name “THE MVRIO” on the right side of the Home banner using neon green (#1ED760) without blocking banner controls and with responsive behavior.",
      "acceptanceCriteria": [
        "The text “THE MVRIO” is visible on top of the banner image, positioned on the right side within the banner area (right-side box placement).",
        "The text color uses neon green (#1ED760) and remains readable on both themes/backgrounds.",
        "The overlay does not block or overlap the existing banner edit controls (upload/link/clear); controls remain clickable and visually accessible.",
        "The overlay is responsive: it stays within the banner area across common mobile and desktop widths without overflowing or being cut off."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/home/HomeChannelBanner.tsx",
          "operation": "modify",
          "description": "Add an absolutely-positioned, right-aligned overlay text element “THE MVRIO” inside the banner (right-side region). Style it with neon green (#1ED760) and readability enhancements (e.g., text-shadow and/or subtle translucent backdrop). Ensure overlay uses pointer-events-none and a lower z-index than the edit controls, and reposition/raise the controls container z-index so upload/link/clear remain visually accessible and clickable. Make overlay responsive (font sizes and max-width constraints) so it stays within the banner area without overflow or clipping."
        }
      ]
    }
  ]
}