{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Mobile playlist favorites per-user persistence UI + working mobile playlist share deep links",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Make mobile PlaylistOverflowMenu Favorites toggle use authenticated per-user backend favorites with pending sign-in action support and correct UI updates.",
      "acceptanceCriteria": [
        "On mobile, tapping the Favorites action in `PlaylistOverflowMenu` toggles favorite state without requiring admin mode.",
        "If the user is signed out, tapping the Favorites action triggers the existing sign-in flow (pending action type `playlist-favorites`) and completes the toggle after successful sign-in.",
        "After toggling, the menu closes and the favorite state reflects the new value (including after navigating away and back)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/usePlaylistFavorites.ts",
          "operation": "modify",
          "description": "Tighten playlist favorites auth gating for mobile flows: ensure `useGetPlaylistFavorites()` only runs for authenticated (non-anonymous) users to avoid unauthorized reads, and keep mutation error handling aligned with pending action type `playlist-favorites` so sign-in can resume the toggle correctly."
        },
        {
          "path": "frontend/src/components/library/PlaylistOverflowMenu.tsx",
          "operation": "modify",
          "description": "Update the mobile overflow Favorites click handling to mirror the song overflow pattern: if not authenticated, close the drawer and call `requireAuth({ type: 'playlist-favorites', playlistName })` without attempting a backend call; if authenticated, call the existing `usePlaylistFavorites(playlistName)` toggle and ensure the menu closes and UI reflects the updated favorite state."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Make mobile PlaylistOverflowMenu Share action generate a hash/query playlist deep link and share via Web Share API when supported, otherwise copy to clipboard with toasts, without redesigning the menu.",
      "acceptanceCriteria": [
        "On mobile, tapping “Share” in `PlaylistOverflowMenu` attempts to open the native share sheet using the Web Share API when available.",
        "If the Web Share API is unavailable or share fails (non-cancel), the deep link is copied to clipboard and a success/failure toast is shown.",
        "The deep link is hash-based and query-param driven, matching the app’s existing song deep-link style (e.g. `#/?playlist=<name>&playlistType=<user|official>`).",
        "No visual redesign of the existing overflow menu beyond changes strictly required to make the Share action function correctly."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/library/PlaylistOverflowMenu.tsx",
          "operation": "modify",
          "description": "Harden the existing Share action for mobile user-gesture reliability: build the deep link via `buildPlaylistDeepLink(playlistName, playlistType)` (hash + query params), attempt `shareViaWebShare` when supported, and on non-cancel failure (or unsupported) fall back to `copyToClipboard` with success/failure toasts; keep the existing menu UI and only adjust logic/close behavior as needed for functionality."
        }
      ]
    }
  ]
}