{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Swap AppHeader logo to generated neon-green music note icon (no layout/functionality changes)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Swap the AppHeader logo image to a neon-green music note (white outline) while keeping all existing header layout/sizing classes unchanged.",
      "acceptanceCriteria": [
        "The header icon renders as a neon-green music note with a white outline.",
        "The icon occupies the same space as before (same container size, same alignment, same spacing).",
        "No other header elements (title/subtitle/messages button/menu button) visually shift due to this change."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/branding/AppHeader.tsx",
          "operation": "modify",
          "description": "Update only the header <img> src to point to the new static asset (frontend/public/assets/generated/header-music-note.dim_128x128.png) while keeping the existing wrapper and image classes (e.g., w-10 h-10, flex layout, gaps, padding) and all click handlers/props untouched."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add the new music-note PNG under frontend/public/assets/generated and reference it directly from AppHeader without backend involvement.",
      "acceptanceCriteria": [
        "A new PNG icon file exists at `frontend/public/assets/generated/` and is used by `AppHeader`.",
        "The header icon loads reliably (no broken image placeholder)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/header-music-note.dim_128x128.png",
          "operation": "create",
          "description": "Add the generated PNG asset (transparent background; neon-green music note with white outline) at this exact path/filename so AppHeader can reference it directly via <img src=...> (no backend routing)."
        },
        {
          "path": "frontend/src/components/branding/AppHeader.tsx",
          "operation": "modify",
          "description": "Ensure the <img> src references /assets/generated/header-music-note.dim_128x128.png directly (static public asset) and does not change any other header structure or styling."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Ensure no header navigation behavior or functionality changes occur as part of the icon swap.",
      "acceptanceCriteria": [
        "All header buttons (menu toggle if present, messages button) behave exactly as before.",
        "No routes, screen navigation, or click handlers are changed as part of this update."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/branding/AppHeader.icon-swap.note.md",
          "operation": "create",
          "description": "Add a short implementation note documenting that this change must remain a src-only icon swap in AppHeader (no changes to navigation, routes, or click handlers), to prevent accidental functional regressions in future edits."
        }
      ]
    }
  ]
}